abandon
ability
able
abuse
academic
academy
accept
access
accompany
accord
account
accuse
achieve
acid
acquire
act
action
active
activity
actor
actress
actual
actually
adapt
add
addition
additional
additionally
address
administration
administrative
adopt
adult
advance
advanced
advantage
advocate
affair
affect
afghanistan
africa
african
age
agency
agent
ago
agree
agreement
agricultural
agriculture
aid
aim
air
aircraft
airline
airport
album
alexander
ali
allege
alliance
allow
ally
alongside
alternative
america
american
americans
amount
analysis
ancient
angle
animal
announce
annual
anti
apart
appeal
appear
appearance
apple
application
apply
appoint
approach
approve
approximately
april
arab
arabia
arabic
architecture
area
argue
argument
arise
arm
armed
army
arrange
arrest
arrive
art
article
artist
asia
asian
ask
aspect
assembly
assert
assist
associate
association
assume
atmosphere
atom
attach
attack
attempt
attend
attention
attract
attribute
audience
august
australia
australian
author
authority
available
average
avoid
award
away
axis
background
bacteria
bad
balance
ball
ban
band
bangladesh
bank
bar
base
basic
basin
basis
battery
battle
bay
bce
bear
beat
begin
beginning
behavior
belief
believe
belong
benefit
bengal
bengali
big
bill
billion
bind
biological
bird
birth
bit
black
block
blood
blue
board
boat
body
bollywood
bomb
bombay
bond
bone
book
border
boundary
box
boy
brain
branch
brand
break
bridge
bring
britain
british
broad
broadcast
brother
brown
buddha
buddhism
buddhist
budget
build
building
burn
bus
business
buy
cabinet
cable
california
call
camera
camp
campaign
campus
canada
canadian
canal
cancer
candidate
capable
capacity
capital
captain
capture
car
carbon
card
care
career
carry
case
cast
caste
castle
catch
category
catholic
cause
cave
celebrate
celebration
cell
census
center
central
centre
century
ceremony
certain
chain
chairman
challenge
chamber
champion
championship
chance
change
channel
chapter
character
characteristic
charge
charles
chemical
chemistry
chicago
chief
child
childhood
china
chinese
choice
choose
christian
christianity
church
cinema
circle
circuit
cite
citizen
city
civil
civilian
claim
class
classic
classical
classification
classify
clear
climate
close
closely
cloud
club
coach
coalition
coast
code
coin
cold
collapse
collect
collection
college
colonial
colony
color
colour
combination
combine
come
comedy
comic
command
commander
comment
commercial
commission
commit
committee
common
commonly
commonwealth
communication
communist
community
company
compare
compete
competition
complete
completely
complex
component
compose
composition
compound
comprise
computer
concentration
concept
concern
conclude
condition
conduct
conference
confirm
conflict
congress
connect
connection
conquer
conquest
consequence
conservative
consider
considerable
consist
constant
constituency
constitute
constitution
constitutional
construct
construction
consume
consumer
consumption
contact
contain
contemporary
content
contest
context
continue
contract
contrast
contribute
contribution
control
controversy
convention
convert
cool
copper
copy
core
corporation
corruption
cost
council
count
counter
country
county
couple
course
court
cover
create
creation
credit
crew
cricket
crime
criminal
crisis
critic
critical
criticism
criticize
crop
crore
cross
crown
cultural
culture
cup
currency
current
currently
custom
customer
cut
cycle
daily
dam
damage
dance
dark
date
datum
daughter
david
day
dead
deal
death
debate
debut
decade
december
decide
decision
declare
decline
decrease
dedicate
deep
defeat
defence
defend
defense
define
definition
degree
deity
delay
delhi
deliver
demand
democratic
demonstrate
density
deny
department
depend
depict
deposit
deputy
derive
describe
description
desert
design
designate
desire
despite
destroy
detail
detect
determine
develop
development
device
dialect
die
differ
difference
different
difficult
difficulty
digital
direct
direction
directly
director
discipline
discover
discovery
discuss
discussion
disease
disorder
display
dispute
distance
distinct
distinguish
distribute
distribution
district
divide
division
dna
doctor
doctrine
document
dog
domestic
dominant
dominate
door
double
draft
drama
draw
dream
drink
drive
driver
drop
drug
dry
dutch
duty
dynasty
early
earn
earth
earthquake
easily
east
eastern
easy
eat
economic
economy
edge
edition
editor
education
educational
edward
effect
effective
effectively
efficiency
effort
egg
egypt
egyptian
elect
election
electric
electrical
electricity
electron
electronic
element
elephant
eliminate
emerge
emergency
emission
emperor
empire
employ
employee
enable
encounter
encourage
end
enemy
energy
engage
engine
engineer
engineering
england
english
enjoy
ensure
enter
entertainment
entire
entirely
entry
environment
environmental
episode
equal
equipment
equivalent
era
error
escape
especially
essential
establish
establishment
estate
estimate
etc
ethnic
etymology
europe
european
event
eventually
evidence
evil
evolution
evolve
example
exception
exchange
execute
executive
exercise
exhibit
exist
existence
expand
expansion
expect
expedition
experience
experiment
expert
explain
export
expose
exposure
express
expression
extend
extension
extensive
extent
external
extreme
extremely
eye
face
facility
fact
factor
factory
fail
failure
fair
faith
fall
family
famous
fan
far
farm
farmer
fashion
fast
father
favor
favour
fear
feature
february
federal
feed
feel
fellow
female
festival
fiber
field
fifth
fight
figure
file
fill
film
final
finally
finance
financial
find
fine
finish
fire
firm
fish
fit
fix
flag
flat
flee
fleet
flight
flood
floor
flow
flower
fluid
fly
focus
folk
follow
follower
following
food
foot
football
force
foreign
forest
form
formal
format
formation
fort
forward
found
foundation
founder
fourth
frame
france
free
freedom
french
frequency
frequently
friend
fruit
fuel
fully
function
fund
fundamental
future
gain
galaxy
game
gandhi
garden
gas
gate
gender
gene
general
generally
generate
generation
genetic
geography
george
german
germany
get
giant
girl
give
glass
global
goal
god
goddess
gold
golden
good
google
govern
government
governor
grade
gradually
graduate
grain
grand
grant
great
greatly
greek
green
gross
ground
group
grow
growth
guard
guide
gujarat
gun
guru
hair
half
hall
han
hand
handle
happen
hard
harry
have
having
head
headquarters
health
hear
heart
heat
heavily
heavy
height
help
henry
heritage
hero
high
highly
highway
hill
hindi
hindu
hinduism
historian
historic
historical
historically
history
hit
hold
hole
holy
home
honor
honour
hope
horse
hospital
host
hot
hotel
hour
house
household
huge
human
hundred
husband
hydrogen
hypothesis
ibn
ice
idea
ideal
identify
identity
iii
image
immediately
impact
imperial
implement
import
importance
important
impose
improve
improvement
incident
include
income
incorporate
increase
increasingly
independence
independent
index
india
indian
indicate
indigenous
individual
indo
indonesia
industrial
industry
infection
influence
influential
information
infrastructure
initial
initially
initiate
initiative
injury
inner
innings
input
inscription
inside
inspire
instal
instance
instead
institute
institution
instrument
integrate
intellectual
intelligence
intend
interaction
interest
interior
internal
international
internet
interpretation
interview
introduce
introduction
invasion
investigation
investment
invite
involve
ion
iran
iraq
ireland
iron
islam
islamic
island
israel
israeli
issue
italian
italy
item
jain
james
january
japan
japanese
jewish
jews
job
john
join
joint
joseph
journal
journalist
judge
july
june
justice
kapoor
kashmir
keep
kerala
key
khan
kill
kilometre
kind
king
kingdom
km²
know
knowledge
korea
korean
krishna
kumar
label
labor
laboratory
labour
lack
lake
land
language
lanka
large
largely
last
late
later
latin
launch
law
lay
layer
lead
leader
leadership
league
learn
learning
leave
lee
left
leg
legal
legend
legislative
length
let
letter
level
liberal
library
lie
life
light
like
likely
limit
limited
line
link
lion
liquid
list
literacy
literary
literature
little
live
load
local
locate
location
london
long
look
lord
los
lose
loss
lot
louis
love
low
machine
magazine
magnetic
maharashtra
main
mainly
maintain
major
majority
make
male
man
manage
management
manager
manner
manufacture
manufacturer
map
march
marine
mark
market
marriage
married
marry
mary
mass
massive
master
match
material
mathematic
matter
maximum
mean
meaning
measure
measurement
mechanical
mechanism
medal
medical
medicine
medieval
medium
meet
meeting
member
memorial
memory
mental
mention
merchant
message
metal
meter
method
metre
mexico
michael
microsoft
mid
middle
mile
military
milk
million
mind
mineral
minister
ministry
minor
minority
minute
miss
missile
mission
mix
mixed
mobile
mode
model
modern
modify
molecule
moment
money
mongol
month
moon
moral
mosque
mother
motion
motor
mount
mountain
move
movement
movie
mughal
muhammad
multi
multiple
mumbai
murder
muscle
museum
music
musical
muslim
muslims
name
narrow
nation
national
nations
native
natural
nature
naval
navy
near
nearby
nearly
necessary
need
negative
nepal
net
network
new
newly
news
newspaper
night
non
normal
normally
north
northern
notable
notably
note
novel
november
nuclear
number
numerous
object
observation
observe
obtain
occasion
occupy
occur
ocean
october
offer
office
officer
official
officially
oil
old
olympic
one
online
open
opening
operate
operation
opinion
opportunity
oppose
opposite
opposition
option
orbit
order
organic
organisation
organise
organism
organization
organize
origin
original
originally
originate
ottoman
outer
output
outside
overall
own
owner
oxygen
pacific
page
pain
paint
painting
pair
pakistan
pakistani
palace
paper
parallel
parent
paris
park
parliament
part
participate
particle
particular
particularly
partner
party
pass
passage
passenger
past
patent
path
patient
pattern
paul
pay
payment
peace
peak
peninsula
people
perceive
percent
perform
performance
period
permanent
permit
persian
person
personal
personality
peter
phase
phenomenon
philosopher
philosophy
phone
physical
physics
pick
picture
piece
pilot
place
plain
plan
plane
planet
plant
plate
platform
play
player
plot
poem
poet
poetry
point
pole
police
policy
polish
politic
political
politician
poor
popular
popularity
population
port
portion
portray
portuguese
position
positive
possibility
possible
possibly
post
potential
power
powerful
practical
practice
pradesh
praise
prayer
pre
predict
prepare
presence
present
preserve
president
presidential
press
pressure
prevent
previous
previously
price
priest
primarily
primary
prime
prince
principal
principle
print
prior
prison
private
prize
pro
probably
problem
procedure
process
processing
produce
producer
product
production
professional
professor
profit
program
programme
progress
project
prominent
promise
promote
proper
property
proposal
propose
protect
protection
protein
protest
prove
provide
province
psychology
public
publication
publish
punjab
purchase
pure
purpose
pursue
push
quality
quantity
quantum
quarter
queen
question
quickly
race
radiation
radio
rail
railway
rain
raise
raj
raja
ram
range
rank
rapid
rapidly
rare
rate
rating
ratio
raw
ray
reach
reaction
read
real
reality
realize
reason
rebellion
receive
recent
recently
recognise
recognition
recognize
recommend
record
recover
red
reduce
reduction
refer
reference
reflect
reform
refuse
regard
regime
region
regional
register
regular
regulation
reign
reject
relate
relation
relationship
relative
relatively
release
religion
religious
rely
remain
remove
rename
repeat
replace
report
represent
representation
representative
republic
request
require
requirement
research
researcher
reserve
resident
resign
resistance
resolution
resource
respect
respectively
respond
response
responsibility
responsible
rest
restore
restrict
result
retain
return
reveal
revenue
reverse
review
revolution
revolutionary
rice
rich
richard
right
ring
rise
risk
ritual
rival
river
road
robert
rock
role
roll
roman
rome
room
root
roughly
round
route
royal
rule
ruler
run
rural
russia
russian
sabha
sacrifice
safe
safety
saint
sale
salt
sample
san
sanskrit
satellite
saudi
save
say
scale
scene
schedule
scheme
scholar
school
science
scientific
scientist
score
scotland
screen
script
sea
seal
search
season
seat
second
secondary
secret
secretary
section
sector
secure
security
see
seed
seek
select
selection
self
sell
semi
send
senior
sense
sentence
separate
september
sequence
series
serve
service
session
set
settle
settlement
seven
severe
sex
sexual
shah
shape
share
shell
shift
ship
shiva
shoot
short
shortly
show
side
sign
signal
significant
significantly
sikh
silver
similar
similarly
simple
simply
sing
singapore
singer
singh
single
sir
sister
sit
site
situate
situation
size
skill
skin
slave
slightly
slow
small
smith
social
socialist
society
software
soil
solar
soldier
solid
solution
son
song
soon
soul
sound
source
south
southeast
southern
soviet
space
spain
spanish
speak
speaker
special
specie
specific
specifically
speech
speed
spend
spirit
spiritual
split
sport
spot
spread
spring
square
sri
stable
stadium
staff
stage
stand
standard
star
start
state
statement
states
station
statue
status
stay
steel
step
stock
stone
stop
storage
store
story
strategy
stream
street
strength
stress
strike
string
strip
strong
strongly
structure
struggle
student
studio
study
style
sub
subject
subsequent
subsequently
substance
succeed
success
successful
successfully
successor
suffer
sugar
suggest
suicide
sultan
summer
sun
super
supply
support
supporter
supreme
surface
surround
survey
survive
switch
symbol
symptom
syria
system
table
take
talk
tamil
tank
target
task
tax
teach
teacher
teaching
team
technical
technique
technology
television
tell
temperature
temple
tend
term
terminal
territory
test
testing
text
theatre
theme
theory
therapy
thermal
thing
think
thomas
thought
thousand
threat
threaten
throne
throw
tibetan
tie
tiger
time
tissue
title
today
tool
total
touch
tour
tourism
tourist
tournament
tower
town
trace
track
trade
tradition
traditional
traditionally
traffic
train
training
transfer
transform
transition
translate
translation
transmission
transmit
transport
transportation
travel
treat
treatment
treaty
tree
trend
trial
tribe
troop
true
trust
truth
try
tube
turkey
turkish
turn
twice
type
typical
typically
ultimately
unable
undergo
understand
understanding
union
unique
unit
united
universal
universe
university
unknown
unlike
upper
urban
usage
use
useful
user
usually
valley
value
van
variable
variation
variety
vary
vast
vehicle
verse
version
vessel
vice
victim
victory
video
vietnam
view
village
violence
virus
vishnu
visible
vision
visit
visitor
visual
voice
voltage
volume
vote
walk
wall
want
war
warm
washington
waste
watch
water
wave
way
weak
wealth
weapon
wear
weather
web
website
week
weight
well
west
western
white
wicket
wide
widely
widespread
wife
wild
william
win
wind
window
wing
winter
wish
withdraw
witness
woman
wood
word
work
worker
world
worldwide
worship
write
writer
writing
year
yellow
yield
yoga
york
young
youth
zealand
zero
zone
